<HTML>
<TITLE>Маломожнова В.М.</TITLE>
<BODY>
 <h1>Маломожнова В.М.</h1><p>
Задача 2.5.<p>
Найти значение переменной z, заданной суммой функций. Для нахождения значения
функции f(u,t) написать пользовательскую функцию. Числа a и b – случайные.<p>
16 Вариант.<p>
<?php
$a = rand(-10, 10);
$b = rand(-10, 10);
print('a = '. $a . '<br>'); //Выводим
print('b = '. $b . '<br>'); //Выводим

//z1
if (($a/$b)<=(sin($a))){
    $z1=(pow($a/$b,4)+sin($a))/(cos(($a/$b)+(M_PI/4)));
}

elseif (($a/$b)>(sin($a))){
  $z1=log(($a/$b)+4)/pow(sin($a)-3,1/2);
}

//z2
if ($b<=(pow($a+$b,1/2))){
    $z2=pow($b,4)+pow($a+$b,1/2)/cos($b+(M_PI/4));
}
elseif ($b<(pow($a+$b,1/2))){
  $z2=log($b+4)/pow(pow($a+$b,1/2)-3,1/2);
} 

print('z = ln| f(a/b,sin(a))| + f(b,(a+b)^(1/2)) '. '<br>'); //Выводим
$z=round(log($z1),5)+round($z2,5);
print('ln| f(a/b,sin(a))| = '. round(log($z1),5) . '<br>'); //Выводим
print('f(b,(a+b)^(1/2)) = '. round($z2,5) . '<br>'); //Выводим
print('z = '. $z); //Выводим
?>
</BODY>
</HTML>